# Частина 1, виконав Пищик Іван, три функції

text = """зРАДИ, РАДОСТІ, ТЕПЛА!
бАГАТСТВА, МИРУ І ПОВАГИ!
хАЙ РИНЕ ЗЛО У НЕБУТТЯ,
мРІЙЛИВОСТІ-ВАМ-ТА-НАСНАГИ!

зДОРОВ’Я ДІТЯМ І СОБІ,
рОБОТУ, ЩО ВАС НАДИХАЄ,
уДАЧІ ПОРУЧ У ЖИТТІ,
дОВІРУ-БЛИЗЬКИХ-ВАМ-БЕЗКРАЮ!

тЕРПІННЯ СЕРЦЮ НА РОКИ.
жИТТЯ ЦІНУЙТЕ КОЖНУ МИТЬ,
хАЙ, ЯК СТРУМОК ГІРСЬКИЙ ЧИСТЕНЬКИЙ,
вОНО-НА-СОНЕЧКУ-БЛИЩИТЬ!"""
# Текс привітання до дня народження
text = text.swapcase() # Зміна регістру на протилежний
text = text.replace("Зради", "Любові") # Заміна слова
a = text.splitlines() # Розбиття рядка на список рядків
print(text, "\n")
print(a, "\n")
# Функції для наступного студента: replace(), upper(), count()

# Частина 2, виконала Дяченко Юлія
text = text.replace("-"," ")#заміна символу "-" на пробіли
text = text.upper()#усі символи рядка переводимо у верхній регістр
print(text, "\n")
print("Кількість пробілів у тексті:", text.count(" "), "\n")#рахуємо та виводимо кількість пробілів
# Функції для наступного студента: casefold(), title(), find(),

# Частина 3, виконав Івженко Тимофій
text = text.casefold() #усі символи рядка переводимо у нижній регістр
text = text.title() #переведення перших літер у словах у верхній регістр
print(text, "\n")
position = text.find("Поруч") #пошук позиції слова у рядку
print("Позиція слова Поруч у рядку:", position)
# Функції для наступного студента: islower(), upper(), isupper()

# Частина 4, виконав Рожченко Іван
isLower = text.islower()#перевірка, чи всі літери у нижньому регістрі
print("\nЧи всі літери у нижньому регістрі:", isLower, "\n")
text = text.upper()#усі літери рядка переводимо у верхній регістр
print(text, "\n")
isUpper = text.isupper()#перевірка, чи всі літери у верхньому регістрі
print("Чи всі літери у верхньому регістрі:", isUpper , "\n")
# Функції для наступного студента:

# Частина 5, виконала Руденко Дарина