# Частина 1, виконав Пищик Іван, три функції
text = """зРАДИ, РАДОСТІ, ТЕПЛА!
бАГАТСТВА, МИРУ І ПОВАГИ!
хАЙ РИНЕ ЗЛО У НЕБУТТЯ,
мРІЙЛИВОСТІ-ВАМ-ТА-НАСНАГИ!

зДОРОВ’Я ДІТЯМ І СОБІ,
рОБОТУ, ЩО ВАС НАДИХАЄ,
уДАЧІ ПОРУЧ У ЖИТТІ,
дОВІРУ-БЛИЗЬКИХ-ВАМ-БЕЗКРАЮ!

тЕРПІННЯ СЕРЦЮ НА РОКИ.
жИТТЯ ЦІНУЙТЕ КОЖНУ МИТЬ,
хАЙ, ЯК СТРУМОК ГІРСЬКИЙ ЧИСТЕНЬКИЙ,
вОНО-НА-СОНЕЧКУ-БЛИЩИТЬ!"""
# Текс привітання до дня народження
text = text.swapcase() # Зміна регістру на протилежний
text = text.replace("Зради", "Любові") # Заміна слова
a = text.splitlines() # Розбиття рядка на список рядків
print(text, "\n")
print(a)
# Частина 2, виконала(в) ..., дві функції